---
kind: property
id: P:Autodesk.Revit.DB.ConnectorElement.Radius
source: html/0b915ed7-c925-fafc-9f10-99541f549184.htm
---
# Autodesk.Revit.DB.ConnectorElement.Radius Property

The radius of the connector.

## Syntax (C#)
```csharp
public virtual double Radius { get; }
```

## Remarks
-1 if the connector is not round.